
start_conv = ["我要", "我想"]
# 业务名称
transaction = ["下载", "收藏", "保存", "取消收藏", "查看", "查询", "在线办理","办理", "在线预约","预约", "在线评价","评价"]

after = [["的办事指南","的指南"], ["的办事指南","的指南"], ["的办事指南","的指南"], ["的办事指南","的指南"], ["的办事指南","的指南"], ["的办事指南","的指南"],
         [""], [""], [""],[""],[""],[""]]
# 事项名称
items = ["固定资产投资项目合理用能审查",
         "建设工程施工许可", "建筑工程施工许可", "建设工程施工许可-建筑工程施工许可",
         "医师执业注册许可-医师执业注册-执业注册", "医师执业注册许可", "医师执业注册", "执业注册", "医师执业注册-执业注册",
         "新建住宅商品房准许交付使用许可",
         "残疾儿童康复救助制度-残疾儿童康复救助申请", "残疾儿童康复救助制度", "残疾儿童康复救助申请",
         "残疾人家庭无障碍改造申请审核",
         "残疾人机动轮椅车燃油补贴申请",
         "残疾人证办理-残疾人证新办", "残疾人证办理", "残疾人证新办",
         "残疾人证办理-残疾人证换领", "残疾人证换领",
         "残疾人证办理-残疾人证迁移", "残疾人证迁移",
         "残疾人证办理-残疾人证补办", "残疾人证补办",
         "残疾人证办理-残疾人证注销", "残疾人证注销",
         "残疾人证办理-残疾人类别变更", "残疾人类别变更",
         "残疾人证办理-残疾人等级变更", "残疾人等级变更",
         "残疾人证办理-残疾人证联系人等信息变更", "残疾人证联系人等信息变更",
         "洪水影响评价许可-河道管理范围内建设项目工程建设方案许可", "洪水影响评价许可", "河道管理范围内建设项目工程建设方案许可",
         "洪水影响评价许可-非防洪建设项目洪水影响评价报告许可", "非防洪建设项目洪水影响评价报告许可",
         "洪水影响评价许可-水利工程建设项目（防洪）规划同意书审查许可", "水利工程建设项目（防洪）规划同意书审查许可",
         "洪水影响评价许可-河道管理范围内建设项目工程建设方案许可", "河道管理范围内建设项目工程建设方案许可",
         "洪水影响评价许可-河道管理范围内建设项目位置和界限审查", "河道管理范围内建设项目位置和界限审查",
         "洪水影响评价许可-国家基本水文测站上下游建设影响水文监测工程的许可", "国家基本水文测站上下游建设影响水文监测工程的许可",
         "户外广告及临时悬挂、设置标语或者宣传品许可-临时悬挂、设置标语或者宣传品许可", "户外广告及临时悬挂、设置标语或者宣传品许可", "临时悬挂、设置标语或者宣传品许可",
         "户外广告及临时悬挂、设置标语或者宣传品许可-户外广告设施许可（不含公交候车亭附属广告及公交车体广告设施）（市级权限委托市内六区实施）",
         "户外广告设施许可（不含公交候车亭附属广告及公交车体广告设施）（市级权限委托市内六区实施）",
         "机动车维修经营备案",
         "设置医疗机构许可、变更-医疗机构执业登记、变更-执业登记", "设置医疗机构许可、变更", "医疗机构执业登记、变更", "设置医疗机构许可、变更-医疗机构执业登记、变更", "医疗机构执业登记、变更-执业登记",
         "生产建设项目水土保持方案的许可",
         "药品经营许可证核发（零售）-药品经营许可证核发、变更、换证（零售）-核发（延续）", "药品经营许可证核发（零售）-药品经营许可证核发、变更、换证（零售）",
         "药品经营许可证核发、变更、换证（零售）-核发（延续）", "药品经营许可证核发（零售）-药品经营许可证核发、变更、换证（零售）-核发", "药品经营许可证核发、变更、换证（零售）-核发",
         "药品经营许可证核发（零售）-药品经营许可证核发、变更、换证（零售）-延续", "药品经营许可证核发、变更、换证（零售）-延续",
         "企业投资项目备案",
         "取水许可-取水许可证核发", "取水许可", "取水许可证核发",
         "建设项目环境影响报告书（表）许可",
         "建设项目环境影响报告书（表）许可-建设项目环境影响报告书（表）许可", "建设项目环境影响报告书（表）许可",
         "建设项目环境影响报告书（表）许可-建设项目环境影响报告书（表）许可-新申请的", "建设项目环境影响报告书（表）许可-新申请的",
         "建设项目环境影响报告书（表）许可-建设项目环境影响报告书（表）许可-环境影响评价文件自批准之日起超过五年方决定开工建设的", "建设项目环境影响报告书（表）许可-环境影响评价文件自批准之日起超过五年方决定开工建设的",
         "实施中等及中等以下学历教育、学前教育、自学考试助学和实施高等以下非学历文化教育的民办学校的筹设、设立、变更与终止的许可",
         "放射性同位素备案",
         "残疾人参加城乡居民基本养老保险缴费补贴",
         "公共场所卫生许可",
         "企业开办类业务问答话术",
         "普通护照签发、换发、补发及加注-首次申请护照", "普通护照签发、换发、补发及加注", "首次申请护照",
         "普通护照签发、换发、补发及加注-护照加注", "护照加注",
         "普通护照签发、换发、补发及加注-护照补发", "护照补发",
         "普通护照签发、换发、补发及加注-换发护照", "换发护照",
         "机动车登记与临时通行牌证核发-机动车登记", "机动车登记与临时通行牌证核发", "机动车登记"
         "客运出租汽车经营资格证件核发-客运出租汽车经营资格证核发", "客运出租汽车经营资格证件核发", "客运出租汽车经营资格证核发",
         "客运出租汽车经营资格证件核发-网络预约出租汽车驾驶员证核发-网络预约出租汽车驾驶员证核发", "客运出租汽车经营资格证件核发-网络预约出租汽车驾驶员证核发", "网络预约出租汽车驾驶员证核发-网络预约出租汽车驾驶员证核发",
         "网络预约出租汽车驾驶员证核发", "网络预约出租汽车驾驶员证核发",
         "客运出租汽车经营资格证件核发-驾驶员客运资格证核发", "驾驶员客运资格证核发",
         "教师资格的认定",
         "养犬登记",
         "港澳台居民定居证明签发",
         "大陆及台湾居民往来两地通行证及签注-台湾居民来往大陆通行证签发", "大陆及台湾居民往来两地通行证及签注", "台湾居民来往大陆通行证签发",
         "大陆及台湾居民往来两地通行证及签注-大陆居民往来台湾通行证签发及签注", "大陆居民往来台湾通行证签发及签注",
         "出入境通行证签发",
         "外国人居留停留-外国人停留证件的签发、换发、补发",
         "外国人居留停留-外国人居留证件的签发、延期、换发、补发-团聚类居留证件签发、延期、换发、补发", "外国人居留停留-外国人居留证件的签发、延期、换发、补发", "外国人居留证件的签发、延期、换发、补发-团聚类居留证件签发、延期、换发、补发", "团聚类居留证件签发、延期、换发、补发",
         "外国人居留停留-外国人居留证件的签发、延期、换发、补发-学习类居留证件签发、延期、换发、补发", "外国人居留证件的签发、延期、换发、补发-学习类居留证件签发、延期、换发、补发", "学习类居留证件签发、延期、换发、补发",
         "外国人居留停留-外国人居留证件的签发、延期、换发、补发-工作类居留证件签发、延期、换发、补发", "外国人居留证件的签发、延期、换发、补发-工作类居留证件签发、延期、换发、补发", "工作类居留证件签发、延期、换发、补发",
         "外国人居留停留-外国人居留证件的签发、延期、换发、补发-记者类居留证件签发、延期、换发、补发", "外国人居留证件的签发、延期、换发、补发-记者类居留证件签发、延期、换发、补发", "记者类居留证件签发、延期、换发、补发",
         "内地居民前往港澳通行证、往来港澳通行证和签注核发",
         "采伐林木许可",
         "从事会计代理记账业务中介机构许可",
         "公共场所卫生许可-设立", "公共场所卫生许可-延续",
         "理发店设立", "理发店延续",
         "美容院设立", "美容院延续",
         "宾馆设立", "宾馆延续",
         "酒店设立", "酒店延续",
         "招待所设立", "招待所延续",
         "KTV设立", "KTV延续",
         "浴池设立", "浴池延续",
         "书店设立", "书店延续",
         "商场设立", "商场延续",
         "电影院设立", "电影院延续",
         "能评",
         "护士执业注册许可-变更注册", "护士执业注册许可-",
         "护士执业注册许可-延续注册",
         "护士执业注册许可-执业注册",
         "护士执业证",
         "护士注册", "护士变更", "护士延续",
         "建设项目夜间施工许可",
         "施工证", "开工证", "装修改造施工证、开工手续",
         "内资企业投资项目备案",
         "立项备案", "环评立项备案", "投资项目备案", "外资备案", "增加产能备案", "固定资产备案", "提升改造", "技术改造",
         "装修厂房备案", "光伏发电备案", "充电桩备案", "太阳能发电备案",
         "排污许可证-变更（基本信息）", "排污许可证",
         "排污许可证-变更（其他信息）、延续",
         "排污许可证-核发",
         "普通道路货物运输经营许可-新设核准","普通道路货物运输经营许可",
         "道路货物运输经营许可", "道路货物运输经营", "道路货物运输许可", "道路货物运输", "道路许可", "道路运输", "运输许可", "货物许可", "货物运输",
         "企业不定时和综合计算工时工作制许可",
         "取水许可-取水许可证核发-延续",
         "取水许可证核发-申领",
         "实施非学历文化教育、自学考试助学的教育机构的许可-变更、延续", "实施非学历文化教育、自学考试助学的教育机构的许可",
         "教育培训变更、延续", "培训机构变更、延续", "培训班变更、延续", "课外班变更、延续", "艺术培训变更、延续", "文化培训变更、延续",
         "体育培训变更、延续","科技培训变更、延续",
         "实施非学历文化教育、自学考试助学的教育机构的许可-筹设、设立",
         "教育培训筹设、设立", "培训机构筹设、设立", "培训班筹设、设立", "课外班筹设、设立", "艺术培训筹设、设立", "文化培训筹设、设立",
         "体育培训筹设、设立","科技培训筹设、设立",
         "环评","环评审批","环境影响评价","环境影响报告书（表）",
         "危险化学品经营许可-变更","危险化学品经营许可",
         "危险化学品经营许可-新办_重新申请",
         "危险化学品经营许可-延期",
         "危险化学品经营许可-依申请注销",
         "医疗机构执业登记、变更-变更登记（含互联网医院）","医疗机构执业登记、变更",
         "门诊部变更登记","口腔门诊部变更登记","综合门诊部变更登记","中医门诊部变更登记","综合医院变更登记","专科医院变更登记","互联网医院变更登记",
         "医疗机构执业登记、变更-执业登记",
         "门诊部执业登记","口腔门诊部执业登记","综合门诊部执业登记","中医门诊部执业登记","综合医院执业登记","专科医院执业登记","互联网医院执业登记",
         "医师执业注册许可-变更执业地点", "医师执业注册许可",
         "医师注册","医师执业证","医师变更","医师执业注册许可-变更执业地点","医师执业注册许可-变更执业范围",
         "医师执业注册许可-医师执业注册-变更执业范围","医师执业注册许可-医师执业注册",
         "职业培训机构设立许可"
         ]
all_sentence = []
import json
with open("link.json", "r") as f :
    link_item = json.load(f)
    for link in link_item:
        items.append(link)
        all_sentence.append(link)
        if "-" in link:
            first = link.split("-")[0]
            if first not in items:
                items.append(first)
                all_sentence.append(first)

for item in items:
    all_sentence.append(item)

# FAQ
faq_count = 0
import json
f = open("faq_recommend.json", "r")
faq_data = json.load(f)
# print(faq_data)
for key in faq_data:
    # print(key)
    if key not in all_sentence:
        all_sentence.append(key)
        faq_count += 1
    if "-" in key:
        first = key.split("-")[0]
        if first not in items:
            items.append(first)
        if first not in all_sentence:
            all_sentence.append(first)
            faq_count += 1

print(faq_count)
# 89206
f.close()


# 生成语句
count = 0

for start in start_conv:
    for tra in range(len(transaction)):
        for item in items:
            for aft in after[tra]:
                sentence = start + transaction[tra] + item + aft
                all_sentence.append(sentence)
                #sentence = start + transaction[tra] + item + "如何" + transaction[tra]
                #all_sentence.append(sentence)
                # print(sentence)
                # f.write(sentence + "\n")
                count += 1

print(len(all_sentence))
f = open("data.txt", "w")
for sentence in all_sentence:
    f.write(sentence + "\n")
f.close()
# 118846